{"id":"37ddf545-1341-4ac7-8823-4554886135b6","user_id":"c7de2c2a-e129-4c4b-a257-54e601ee1969","household_id":"a01449a3-3549-4c2d-9800-1f52f4826096","group_id":"9caafcab-dc93-4b1f-9ea8-3f6dd8dcd45c","name":"Our Ultimate Guide to Making Bagels","slug":"our-ultimate-guide-to-making-bagels","image":"5M7x","recipe_servings":0.0,"recipe_yield_quantity":0.0,"recipe_yield":"","total_time":null,"prep_time":null,"cook_time":null,"perform_time":null,"description":"From proofing and shaping to boiling and baking, let Claire Saffitz show you the ins and outs of this breakfast favorite.","recipe_category":[],"tags":[{"id":"62266d92-2d8c-4b99-bcfd-9353c8de937a","group_id":"9caafcab-dc93-4b1f-9ea8-3f6dd8dcd45c","name":"Bread","slug":"bread"},{"id":"0ef038d3-2440-4e64-817e-81c4857ebd39","group_id":"9caafcab-dc93-4b1f-9ea8-3f6dd8dcd45c","name":"Claire","slug":"claire"}],"tools":[],"rating":null,"org_url":"https://cooking.nytimes.com/article/bagels","date_added":"2025-08-01","date_updated":"2025-08-01T03:01:32.655244Z","created_at":"2025-08-01T02:56:11.957335Z","updated_at":"2025-08-01T03:01:32.658814Z","last_made":null,"recipe_ingredient":[{"quantity":1.0,"unit":null,"food":null,"note":"2¼ cups/530 milliliters lukewarm water (105 to 110 degrees)","is_food":false,"disable_amount":true,"display":"2¼ cups/530 milliliters lukewarm water (105 to 110 degrees)","title":"","original_text":null,"reference_id":"9c334945-7119-42d5-9db0-71e1b41437a8"},{"quantity":1.0,"unit":null,"food":null,"note":"2 tablespoons barley malt syrup (available in health food stores and some well-stocked supermarkets; an equal volume of molasses is a passable substitute, but won’t impart the traditional malty flavor)","is_food":false,"disable_amount":true,"display":"2 tablespoons barley malt syrup (available in health food stores and some well-stocked supermarkets; an equal volume of molasses is a passable substitute, but won’t impart the traditional malty flavor)","title":"","original_text":null,"reference_id":"699a7951-c064-43de-a25f-63e4ace4da39"},{"quantity":1.0,"unit":null,"food":null,"note":"1 (¼-ounce) packet active dry yeast (about 2¼ teaspoons)","is_food":false,"disable_amount":true,"display":"1 (¼-ounce) packet active dry yeast (about 2¼ teaspoons)","title":"","original_text":null,"reference_id":"f9a66490-4df4-4a2e-9160-e143d6f5c792"},{"quantity":1.0,"unit":null,"food":null,"note":"6½ cups/885 grams bread flour (or use 6 cups bread flour and ½ cup whole-wheat flour), plus more for kneading","is_food":false,"disable_amount":true,"display":"6½ cups/885 grams bread flour (or use 6 cups bread flour and ½ cup whole-wheat flour), plus more for kneading","title":"","original_text":null,"reference_id":"1f05d3a4-72d3-4293-b969-67be72226bcf"},{"quantity":1.0,"unit":null,"food":null,"note":"2 tablespoons/17 grams Diamond Crystal kosher salt or 1 tablespoon/17 grams Morton kosher salt","is_food":false,"disable_amount":true,"display":"2 tablespoons/17 grams Diamond Crystal kosher salt or 1 tablespoon/17 grams Morton kosher salt","title":"","original_text":null,"reference_id":"5796695e-e5ab-4359-bc3c-f2ea1863bd29"},{"quantity":1.0,"unit":null,"food":null,"note":"Neutral oil, for greasing the baking sheets","is_food":false,"disable_amount":true,"display":"Neutral oil, for greasing the baking sheets","title":"","original_text":null,"reference_id":"9c6aa942-acfc-459d-b717-feef2b8a485d"},{"quantity":1.0,"unit":null,"food":null,"note":"1 teaspoon baking soda","is_food":false,"disable_amount":true,"display":"1 teaspoon baking soda","title":"","original_text":null,"reference_id":"35e71858-6a6e-433c-a4d4-0ca085ae91b2"},{"quantity":1.0,"unit":null,"food":null,"note":"¼ cup/60 milliliters barley malt syrup, plus more as needed","is_food":false,"disable_amount":true,"display":"¼ cup/60 milliliters barley malt syrup, plus more as needed","title":"","original_text":null,"reference_id":"f3754716-6082-427f-bbd0-71ef4a47404d"},{"quantity":1.0,"unit":null,"food":null,"note":"2 ounces/30 grams each sesame seeds, poppy seeds, caraway seeds, dried minced garlic, dried minced onion and/or flaky salt ","is_food":false,"disable_amount":true,"display":"2 ounces/30 grams each sesame seeds, poppy seeds, caraway seeds, dried minced garlic, dried minced onion and/or flaky salt","title":"","original_text":null,"reference_id":"b7218433-fbc4-4517-a489-3df5a6413cac"}],"recipe_instructions":[{"id":"5f41dc9d-677e-47fd-aaa5-17b03c7b5633","title":"Mixing","summary":"","text":"1. Pour ½ cup/120 milliliters lukewarm water into a small bowl. Whisk in 2 tablespoons barley malt syrup and the packet of yeast until both dissolve. Let sit until the mixture foams, about 5 minutes.","ingredient_references":[]},{"id":"b4a94edb-9617-4ab2-a49b-ca1a98e82dbc","title":"","summary":"","text":"2. In a large bowl, combine bread flour and salt (and whole-wheat flour, if using), and make a well in the center. Pour in yeast mixture and the remaining 1¾ cups/420 milliliters lukewarm water, and mix, using the flexible spatula or wooden spoon, until the dough is shaggy.","ingredient_references":[]},{"id":"799144db-8636-4229-b62c-79e823f03ed0","title":"","summary":"","text":"3. Knead the mixture in the bowl several times, continuously folding it over and onto itself and pressing down firmly to bring it together in a solid mass, then turn it out onto a clean work surface. Continue kneading until there are no dry spots, then, adding more flour only if needed to prevent stubborn sticking, until you have a stiff but very smooth dough that is still slightly tacky, 15 to 20 minutes. Tip: This amount of kneading, necessary to develop the gluten for a chewy bagel, is best done by hand, since the motor of the average stand mixer would strain against the very stiff dough.","ingredient_references":[]},{"id":"8601a2ab-d797-4a68-a12c-0f93179bd4b0","title":"","summary":"","text":"4. Gather the dough into a ball, dust it lightly with flour, and place it in a large, clean bowl, seam-side down. Cover with a damp towel and let the dough rise at room temperature until it has doubled in size, 1½ to 2 hours.","ingredient_references":[]},{"id":"fb8acc18-2b1e-451c-900a-1e7696584c19","title":"Preshaping","summary":"","text":"5. Using your fist, lightly punch down the dough to knock out some of the air, and turn it out onto a clean work surface. Using a bench scraper, cut the dough into 12 equal pieces, either eyeballing it or using a scale to weigh out 4⅓-ounce/125-gram pieces. If you prefer a slightly smaller bagel, which is more traditional, you could make a baker’s dozen (13) and weigh out 4-ounce portions. Why? This will help all your bagels rise more evenly in the oven and look better overall.","ingredient_references":[]},{"id":"dc08dc7e-4e54-43d9-8906-ef2b8480dbb4","title":"","summary":"","text":"6. Before you form the bagels, preshape the pieces into tight balls. Working one ball at a time, gather all the irregular edges and pinch them together firmly to make a teardrop shape (above). Place the dough seam-side down on the surface and cup your hand down and over top of the dough in a loose grip (like a claw, or like you’re playing the piano).","ingredient_references":[]},{"id":"e2c541a5-27ed-44be-9bf4-70eaec0ee2d4","title":"","summary":"","text":"Move your hand in a rapid circular motion, dragging the dough across the surface until it has a high, tight dome. Repeat with all the pieces, then cover them with the damp towel and let rest for 5 minutes.","ingredient_references":[]},{"id":"da9ceec6-a2c8-4d7e-9f75-1279ddb4aa9d","title":"Shaping and Proofing","summary":"","text":"7. Line two large rimmed baking sheets with parchment paper, brush lightly with oil, and set aside. Working one piece at a time, roll out a ball on the surface beneath your palms into a 9-inch-long rope. Apply extra pressure at the ends of the rope to thin them slightly, then wrap the rope around one hand where your palm and fingers meet, overlapping the ends by an inch or two along the inside of your hand (above). Tip: Don’t add flour to your work surface. The friction with the surface will help stretch the dough.","ingredient_references":[]},{"id":"5bf63a5c-6b48-4470-87c9-59d42882cad1","title":"","summary":"","text":"8. Roll the dough under your hand back and forth several times to seal together the ends, then slip the ring of dough off your hand and stretch it to even out the thickness all the way around until you have a ring that measures about 4 inches across (above). As you form each ring, place it on a parchment-lined sheet, arranging six to a sheet and spacing evenly. Tip: You can also poke a thumb through the ball of dough to make the hole and then widen and stretch with your hands into a ring, but the wrapping and rolling method tends to give more of a classic bagel look.","ingredient_references":[]},{"id":"a546f01d-56d3-48aa-beb0-3a987dc0abda","title":"","summary":"","text":"9. When you’ve formed all the bagels, cover each baking sheet with a piece of plastic, followed by a damp towel to create a sealed, moist environment for the bagels to proof slowly. Transfer the baking sheets to the refrigerator and chill at least 4 hours and up to 24.","ingredient_references":[]},{"id":"8c346003-423a-48c2-8a20-afb56411fb91","title":"Boiling","summary":"","text":"10. About 2 hours before you’d like to serve the bagels, arrange an oven rack in the center position and heat the oven to 450 degrees. Fill a large, wide Dutch oven halfway with water and place it on the stove. (Heat should be off at this point.) Set a wire rack next to the Dutch oven. If topping the bagels, spread several tablespoons each of sesame seeds, poppy seeds, caraway seeds, dried minced garlic, dried minced onion and flaky salt on separate large plates in generous, even layers. Set the plates of toppings next to the wire rack. Tip: Mix together all the toppings to make an “everything” blend.","ingredient_references":[]},{"id":"89ce184b-0eee-4428-8e34-da145a19281e","title":"","summary":"","text":"11. Remove one baking sheet from the refrigerator. Fill a small bowl with room temperature water, then carefully peel one ring of dough off the parchment paper and transfer it to the bowl. It should float, indicating that the bagels are ready to boil and bake. Remove the ring from the water, pat it dry on a towel and place back on the baking sheet. Remove the other baking sheet from the refrigerator. Tip: The dough sank? That’s OK! Let both sheets sit at room temperature, covered, to finish rising, and test if the dough floats every 10 minutes after the first 30 minutes or so.","ingredient_references":[]},{"id":"7937f010-3690-488d-9a32-c102cca421f0","title":"","summary":"","text":"12. Set the Dutch oven over high heat and bring to a boil. Whisk in the baking soda and ¼ cup barley malt syrup. You want the water to look like strong black tea, so add more barley malt syrup by the tablespoon until it does. Bring everything back to a boil, reduce the heat if necessary to maintain a gentle boil, and skim any foam from the surface. Uncover one baking sheet and carefully transfer as many bagels as will comfortably fit in one layer to the Dutch oven, leaving some room for them to bob around. Boil for 1 minute, turning halfway through. Tip: If the ¼ cup barley malt syrup made the liquid very dark, more like black coffee, add a little water to dilute.","ingredient_references":[]},{"id":"452fbaad-af55-4598-bd6f-a7f9a7e5dcb6","title":"","summary":"","text":"13. Use a spider or slotted spoon to transfer the bagels to the wire rack and repeat with the remaining bagels on the first sheet. The bagels will swell in the water, then deflate when removed, but they will puff up again in the oven. Discard the piece of parchment that was underneath the bagels but reserve the baking sheet.","ingredient_references":[]},{"id":"6664fce2-a4dd-4005-b4c6-20adc5851a44","title":"Baking","summary":"","text":"14. Add the optional topping: Working with one at a time, place a boiled bagel on one of the plates with the toppings and turn to coat so the topping adheres to the wet surface of the dough on both sides. Place the coated bagels on the empty baking sheet, flat-side down, and repeat with the remaining boiled bagels, spacing evenly.","ingredient_references":[]},{"id":"363339dd-3efd-4441-9d3b-b6828f46edb0","title":"","summary":"","text":"15. Transfer the baking sheet to the oven and bake until the bagels are deeply brown, 20 to 25 minutes, rotating the baking sheet 180 degrees after 12 minutes.","ingredient_references":[]},{"id":"3c79141b-6ff7-479c-8d61-a13f0ce4c707","title":"","summary":"","text":"16. While the first sheet of bagels is in the oven, repeat the boiling and coating process with the second sheet, adding more toppings to the plates as needed. Transfer the second sheet to the oven when the first is finished. Let the bagels cool completely on a wire rack before slicing with a serrated knife. Tip: Bagels are best eaten the day they’re baked, but they also freeze well. Place the bagels in a resealable plastic freezer bag and freeze up to one month.","ingredient_references":[]}],"nutrition":{"calories":null,"carbohydrate_content":null,"cholesterol_content":null,"fat_content":null,"fiber_content":null,"protein_content":null,"saturated_fat_content":null,"sodium_content":null,"sugar_content":null,"trans_fat_content":null,"unsaturated_fat_content":null},"settings":{"public":true,"show_nutrition":false,"show_assets":false,"landscape_view":false,"disable_comments":false,"disable_amount":true,"locked":false},"assets":[],"notes":[],"extras":{},"comments":[]}